ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_can.c
/**
  ******************************************************************************
  * @file    MDR32FxQI_can.c
  * @author  Milandr Application Team
  * @version V2.0.2i
  * @date    17/03/2022
  * @brief   This file contains all the CAN firmware functions.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_can.h"

/** @addtogroup __MDR32FxQI_StdPeriph_Driver MDR32FxQI Standard Peripherial Driver
  * @{
  */

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32F1QI)

/** @defgroup CAN CAN
  * @{
  */

/** @defgroup CAN_Private_Defines CAN Private Defines
  * @{
  */

#define IS_CAN_ALL_PERIPH(PERIPH)  (((PERIPH) == MDR_CAN1) || \
                                    ((PERIPH) == MDR_CAN2))

/** @} */ /* End of group CAN_Private_Defines */


/** @defgroup CAN_Private_FunctionPrototypes CAN Private Function Prototypes
  * @{
  */
static uint32_t CAN_ReadBufferSFR(__IO uint32_t* SFR);

/** @} */ /* End of group CAN_Private_FunctionPrototypes */


/** @defgroup CAN_Private_Functions CAN Private Functions
  * @{
  */

/**
  * @brief  Deinitializes the CANx peripheral registers to their default reset values.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @retval None
  */
void CAN_DeInit(MDR_CAN_TypeDef* CANx)
{
    uint32_t i;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));

    CANx->CONTROL = 0;
    CANx->STATUS = 0;
    CANx->BITTMNG = 0;
    CANx->INT_EN = 0;
    CANx->OVER = 0;
    CANx->INT_RX = 0;
    CANx->INT_TX = 0;

    for (i = 0; i < 32; i++)
    {
        CANx->BUF_CON[i] = 0;
    }
}

/**
  * @brief  Initializes the CANx peripheral according to the specified
  *         parameters in the CAN_InitStruct.
  * @note   This function may be called only if appropriate CANx controller
  *         is in the disabled state.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  CAN_InitStruct: pointer to a @ref CAN_InitTypeDef structure
  *         that contains the configuration information for the specified CAN peripheral.
  * @retval None
  */
void CAN_Init(MDR_CAN_TypeDef* CANx, const CAN_InitTypeDef* CAN_InitStruct)
{
    uint32_t tmpreg_CONTROL = 0;
    uint32_t tmpreg_BITTMNG;
    uint32_t i;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_ROP));
    assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_SAP));
    assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_STM));
    assert_param(IS_FUNCTIONAL_STATE(CAN_InitStruct->CAN_ROM));
    assert_param(IS_CAN_PSEG_VALUE(CAN_InitStruct->CAN_PSEG));
    assert_param(IS_CAN_SEG1_VALUE(CAN_InitStruct->CAN_SEG1));
    assert_param(IS_CAN_SEG2_VALUE(CAN_InitStruct->CAN_SEG2));
    assert_param(IS_CAN_SJW_VALUE(CAN_InitStruct->CAN_SJW));
    assert_param(IS_CAN_SAMPLING_MODE(CAN_InitStruct->CAN_SB));

    /* Configure CONTROL register*/
    if (CAN_InitStruct->CAN_ROP != DISABLE)
    {
        tmpreg_CONTROL |= CAN_CONTROL_ROP;
    }
    if (CAN_InitStruct->CAN_SAP != DISABLE)
    {
        tmpreg_CONTROL |= CAN_CONTROL_SAP;
    }
    if (CAN_InitStruct->CAN_STM != DISABLE)
    {
        tmpreg_CONTROL |= CAN_CONTROL_STM;
    }
    if (CAN_InitStruct->CAN_ROM != DISABLE)
    {
        tmpreg_CONTROL |= CAN_CONTROL_ROM;
    }
    CANx->CONTROL = tmpreg_CONTROL;

    /* Configure BITTMNG register*/
    tmpreg_BITTMNG = CAN_InitStruct->CAN_PSEG + CAN_InitStruct->CAN_SEG1 +
                     CAN_InitStruct->CAN_SEG2 + CAN_InitStruct->CAN_SJW +
                     (uint32_t)(CAN_InitStruct->CAN_BRP);
    tmpreg_BITTMNG |= CAN_InitStruct->CAN_SB;
    CANx->BITTMNG = tmpreg_BITTMNG;

    /* Initialize Filters */
    for (i = 0; i < 32; i++)
    {
        CANx->CAN_BUF_FILTER[i].FILTER = 0;
        CANx->CAN_BUF_FILTER[i].MASK = 0;
    }

    /* Configure OVER register*/
    CANx->OVER = (uint32_t)(CAN_InitStruct->CAN_OVER_ERROR_MAX);
}

/**
  * @brief  Fills each CAN_InitStruct member with its default value.
  * @param  CAN_InitStruct: pointer to a @ref CAN_InitTypeDef structure
  *         that is to be initialized.
  * @retval None
  */
void CAN_StructInit(CAN_InitTypeDef* CAN_InitStruct)
{
    /* Reset CAN init structure parameters values */
    /* Own packet reception: disabled */
    CAN_InitStruct->CAN_ROP = DISABLE;
    /* Sending ACK on own packets: disabled */
    CAN_InitStruct->CAN_SAP = DISABLE;
    /* Self Test mode: disabled */
    CAN_InitStruct->CAN_STM = DISABLE;
    /* Read Only mode: disabled */
    CAN_InitStruct->CAN_ROM = DISABLE;
    /* CAN_PSEG member */
    CAN_InitStruct->CAN_PSEG = CAN_PSEG_Mul_1TQ;
    /* CAN_SEG1 member */
    CAN_InitStruct->CAN_SEG1 = CAN_SEG1_Mul_2TQ;
    /* CAN_SEG2 member */
    CAN_InitStruct->CAN_SEG2 = CAN_SEG2_Mul_6TQ;
    /* CAN_SEG2 member */
    CAN_InitStruct->CAN_SJW = CAN_SJW_Mul_1TQ;
    /* Sampling mode member */
    CAN_InitStruct->CAN_SB = CAN_SB_1_SAMPLE;
    /* CAN_BRP member */
    CAN_InitStruct->CAN_BRP = 0;
    /* CAN_OVER_ERROR_MAX member */
    CAN_InitStruct->CAN_OVER_ERROR_MAX = 255;
}

/**
  * @brief  Initializes the CANx Buffer filter and mask according to
  *         the specified parameters in the CAN_FilterInitStruct.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  BufferNumber: the number of the buffer that is used for reception.
  * @param  CAN_FilterInitStruct: pointer to a @ref CAN_FilterInitTypeDef structure
  *         that contains the configuration information.
  * @retval None.
  */
void CAN_FilterInit(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_FilterInitTypeDef* CAN_FilterInitStruct)
{
    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_BUFFER(BufferNumber));
    assert_param(IS_CAN_ID(CAN_FilterInitStruct->Filter_ID));
    assert_param(IS_CAN_ID(CAN_FilterInitStruct->Mask_ID));

