ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_can.c
    CANx->CAN_BUF_FILTER[BufferNumber].FILTER  = CAN_FilterInitStruct->Filter_ID;
    CANx->CAN_BUF_FILTER[BufferNumber].MASK    = CAN_FilterInitStruct->Mask_ID;
}

/**
  * @brief  Enables or disables the specified CAN interrupts.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  CAN_IT: specifies the CAN interrupt sources to be enabled or disabled.
  *         This parameter can be any combination of @ref CAN_IT_Def values.
  * @param  NewState: new state of the CAN interrupts.
  * @retval None.
  */
void CAN_ITConfig(MDR_CAN_TypeDef* CANx, uint32_t CAN_IT, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_ITConfig(CAN_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        CANx->INT_EN |= CAN_IT;
    }
    else
    {
        CANx->INT_EN &= ~CAN_IT;
    }
}

/**
  * @brief  Searches for disabled (i.e., not currently used for reception
  *         or transmission) buffer.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @retval Number of the first found (with lesser number) disabled buffer
  *         or @ref CAN_BUFFER_NUMBER (= 32) if there is no such a buffer.
  */
uint32_t CAN_GetDisabledBuffer(MDR_CAN_TypeDef* CANx)
{
    uint32_t buffer_number;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));

    for (buffer_number = 0;
         ((buffer_number < CAN_BUFFER_NUMBER) && ((CANx->BUF_CON[buffer_number] & CAN_STATUS_EN) != 0));
         buffer_number++);

    return buffer_number;
}

/**
  * @brief  Searches for an empty transfer buffer.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @retval Number of the first found (with lesser number) empty buffer
  *         or CAN_BUFFER_NUMBER (= 32) if there is no such a buffer.
  */
uint32_t CAN_GetEmptyTransferBuffer(MDR_CAN_TypeDef* CANx)
{
    uint32_t buffer_number;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));

    for (buffer_number = 0; (buffer_number < CAN_BUFFER_NUMBER) &&
         ((CANx->BUF_CON[buffer_number] & (CAN_STATUS_EN | CAN_STATUS_TX_REQ | CAN_STATUS_RX_TXn)) != CAN_STATUS_EN);
         buffer_number++);

    return buffer_number;
}

/**
  * @brief  Initiates the transmission of a message.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  BufferNumber: the number of the buffer that is used for transmission.
  * @param  TxMessage: pointer to a @ref CAN_TxMsgTypeDef structure.
  * @retval None
  */
void CAN_Transmit(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_TxMsgTypeDef* TxMessage)
{
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_BUFFER(BufferNumber));
    assert_param(IS_CAN_IDTYPE(TxMessage->IDE));
    assert_param(IS_CAN_DLC(TxMessage->DLC));
    assert_param(IS_FUNCTIONAL_STATE(TxMessage->PRIOR_0));
    assert_param(IS_CAN_ID(TxMessage->ID));

    /* Configure CAN_BUF_ID and CAN_BUF_DLC registers */
    /* Packet format */
    if (TxMessage->IDE == CAN_ID_STD)
    {
        /* Standard */
        tmpreg = CAN_BUF_DLC_STD + TxMessage->DLC;
    }
    else
    {
        /* Extended */
        tmpreg = CAN_BUF_DLC_EXT + TxMessage->DLC;
    }
    CANx->CAN_BUF[BufferNumber].DLC = tmpreg;
    CANx->CAN_BUF[BufferNumber].ID  = TxMessage->ID;

    /* Buffer data unit */
    CANx->CAN_BUF[BufferNumber].DATAL = TxMessage->Data[0];
    CANx->CAN_BUF[BufferNumber].DATAH = TxMessage->Data[1];

    /* Configure CAN_BUF_CON register */
    tmpreg = 0;
    /* Transmission priority */
    if (TxMessage->PRIOR_0 != DISABLE)
    {
        tmpreg |= CAN_BUF_CON_PRIOR_0;
    }
    /* Set transmission request bit */
    tmpreg |= CAN_BUF_CON_TX_REQ;
    /* Enable buffer */
    tmpreg |= CAN_BUF_CON_EN;

    CANx->BUF_CON[BufferNumber] = tmpreg;
}

/**
  * @brief  Initiates the Remote Transfer Request.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  BufferNumber: the number of the buffer that is used for transmission.
  * @param  RTRMessage: pointer to a @ref CAN_RTRMessageTypeDef structure.
  * @retval None
  */
void CAN_SendRTR(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_RTRMessageTypeDef* RTRMessage)
{
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_BUFFER(BufferNumber));
    assert_param(IS_CAN_IDTYPE(RTRMessage->IDE));
    assert_param(IS_FUNCTIONAL_STATE(RTRMessage->PRIOR_0));
    assert_param(IS_CAN_ID(RTRMessage->ID));

    /* Configure CAN_BUF_ID and CAN_BUF_DLC registers */
    /* Packet format */
    if (RTRMessage->IDE == CAN_ID_STD)
    {
        /* Standard */
        tmpreg = CAN_BUF_DLC_STD;
    }
    else
    {
        /* Extended */
        tmpreg = CAN_BUF_DLC_EXT;
    }
    CANx->CAN_BUF[BufferNumber].DLC = tmpreg + CAN_RTR_REMOTE;
    CANx->CAN_BUF[BufferNumber].ID  = RTRMessage->ID;

    /* Configure CAN_BUF_CON register */
    tmpreg = 0;
    /* Transmission priority */
    if (RTRMessage->PRIOR_0 != DISABLE)
    {
        tmpreg |= CAN_BUF_CON_PRIOR_0;
    }
    /* Set transmission request bit */
    tmpreg |= CAN_BUF_CON_TX_REQ;
    /* Enable buffer */
    tmpreg |= CAN_BUF_CON_EN;

    CANx->BUF_CON[BufferNumber] = tmpreg;
}

/**
  * @brief  Initiates the Remote Transfer Request reply.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  BufferNumber: the number of the buffer that is used for transmission.
  * @param  RTRReplyMessage: pointer to a @ref CAN_RTRReplyTypeDef structure.
  * @retval None
  */
void CAN_RTRReply(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_RTRReplyTypeDef* RTRReplyMessage)
{
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_BUFFER(BufferNumber));
    assert_param(IS_CAN_IDTYPE(RTRReplyMessage->IDE));
    assert_param(IS_CAN_ID(RTRReplyMessage->ID));
    assert_param(IS_CAN_DLC(RTRReplyMessage->DLC));

