ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_can.c
    /* Configure CAN_BUF_ID and CAN_BUF_DLC registers */
    /* Configure CAN_BUF_ID and CAN_BUF_DLC registers */
    /* Packet format */
    if (RTRReplyMessage->IDE == CAN_ID_STD)
    {
        /* Standard */
        tmpreg = CAN_BUF_DLC_STD + RTRReplyMessage->DLC;
    }
    else
    {
        /* Extended */
        tmpreg = CAN_BUF_DLC_EXT + RTRReplyMessage->DLC;
    }
    CANx->CAN_BUF[BufferNumber].DLC = tmpreg;
    CANx->CAN_BUF[BufferNumber].ID  = RTRReplyMessage->ID;

    /* Buffer data unit */
    CANx->CAN_BUF[BufferNumber].DATAL = RTRReplyMessage->Data[0];
    CANx->CAN_BUF[BufferNumber].DATAH = RTRReplyMessage->Data[1];

    /* Configure CAN_BUF_CON register */
    /* Set RTR_EN bit */
    tmpreg = CAN_STATUS_RTR_EN;
    /* Enable buffer */
    tmpreg |= CAN_BUF_CON_EN;

    CANx->BUF_CON[BufferNumber] = tmpreg;
}

/**
  * @brief  Starts the waiting for the receiving of a message.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  BufferNumber: the number of the buffer that is used for reception.
  * @param  OverWrite - @ref FunctionalState - Enables or disables overwrite mode.
  * @retval None
  */
void CAN_Receive(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, FunctionalState OverWrite)
{
    uint32_t tmpreg = 0;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_BUFFER(BufferNumber));
    assert_param(IS_FUNCTIONAL_STATE(OverWrite));

    /* Configure CAN_BUF_CON register */
    /* Overwrite mode */
    if (OverWrite != DISABLE)
    {
        tmpreg = CAN_BUF_CON_OVER_EN;
    }
    /* Configure buffer for receiving and enable it */
    tmpreg |= CAN_BUF_CON_RX_TXN | CAN_BUF_CON_EN;

    CANx->BUF_CON[BufferNumber] = tmpreg;
}

/**
  * @brief  Reads the received data from buffer.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  BufferNumber: the number of the buffer that is used for reception.
  * @param  RxBuffer: @ref CAN_DataTypeDef array to place received data to.
  * @retval None
  */
void CAN_GetReceivedData(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_DataTypeDef RxBuffer)
{
    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_BUFFER(BufferNumber));

    RxBuffer[0] = CAN_ReadBufferSFR(&(CANx->CAN_BUF[BufferNumber].DATAL));
    RxBuffer[1] = CAN_ReadBufferSFR(&(CANx->CAN_BUF[BufferNumber].DATAH));
}

/**
  * @brief  Reads received message (containing both header and data) from buffer.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  BufferNumber: the number of the buffer that is used for reception.
  * @param  RxMessage: pointer to a @ref CAN_RxMsgTypeDef.
  * @retval None
  */
void CAN_GetRawReceivedData(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber, CAN_RxMsgTypeDef* RxMessage)
{
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_BUFFER(BufferNumber));

    /* Get the DLC */
    tmpreg = CAN_ReadBufferSFR(&(CANx->CAN_BUF[BufferNumber].DLC));

    RxMessage->Rx_Header.DLC = (uint8_t)(tmpreg & CAN_DLC_DATA_LENGTH);
    /* Get the IDE */
    RxMessage->Rx_Header.IDE = CAN_ID_STD;
    if ((tmpreg & CAN_DLC_IDE) != 0)
    {
        RxMessage->Rx_Header.IDE = CAN_ID_EXT;
    }
    /* Get the OVER_EN */
    RxMessage->Rx_Header.OVER_EN = DISABLE;
    tmpreg = CAN_ReadBufferSFR(&(CANx->BUF_CON[BufferNumber]));
    if ((tmpreg & CAN_BUF_CON_OVER_EN) != 0)
    {
        RxMessage->Rx_Header.OVER_EN = ENABLE;
    }
    /* Get the Id */
    RxMessage->Rx_Header.ID = CAN_ReadBufferSFR(&(CANx->CAN_BUF[BufferNumber].ID));

    /* Get the data field */
    RxMessage->Data[0] = CAN_ReadBufferSFR(&(CANx->CAN_BUF[BufferNumber].DATAL));
    RxMessage->Data[1] = CAN_ReadBufferSFR(&(CANx->CAN_BUF[BufferNumber].DATAH));
}

/**
  * @brief  Releases the buffer.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  BufferNumber: the number of the buffer to be released.
  * @retval None.
  */
void CAN_BufferRelease(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber)
{
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_BUFFER(BufferNumber));

    tmpreg = CANx->BUF_CON[BufferNumber];
    tmpreg &= ~CAN_STATUS_EN;
    CANx->BUF_CON[BufferNumber] = tmpreg;
}

/**
  * @brief  Enables or disables the specified CAN peripheral.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  NewState - @ref FunctionalState - new state of the CANx peripheral.
  * @retval None
  */
void CAN_Cmd(MDR_CAN_TypeDef* CANx, FunctionalState NewState)
{
    uint32_t tmpreg_CONTROL;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmpreg_CONTROL = CANx->CONTROL;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable CANx by setting the CAN_EN bit in the CONTROL register */
        tmpreg_CONTROL |= CAN_CONTROL_CAN_EN;
    }
    else
    {
        /* Disable CANx by resetting the CAN_EN bit in the CONTROL register */
        tmpreg_CONTROL &= ~CAN_CONTROL_CAN_EN;
    }

    /* Configure CONTROL register with new value */
    CANx->CONTROL = tmpreg_CONTROL;
}

/**
  * @brief  Returns the CANx Status Register value.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @retval The CANx_STATUS Register value.
  */
uint32_t CAN_GetStatus(MDR_CAN_TypeDef* CANx)
{
    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));

    return CANx->STATUS;
}

/**
  * @brief  Returns the CANx_BUF_xx_CON Register value.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  BufferNumber: The number of the buffer.
  * @retval The CANx_BUF_xx_CON Register value.
  */
uint32_t CAN_GetBufferStatus(MDR_CAN_TypeDef* CANx, uint32_t BufferNumber)
{
    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_BUFFER(BufferNumber));

    return CANx->BUF_CON[BufferNumber];
}

/**
  * @brief  Checks whether the specified CAN interrupt enable or disable.
  * @param  CANx: Select the CAN peripheral.
  *         This parameter can be one of the following values: MDR_CAN1, MDR_CAN2.
  * @param  CAN_IT - @ref CAN_IT_Def - specifies the CAN interrupt sources to be enabled or disabled.
  * @retval @ref ITStatus - The state of CAN_IT (SET or RESET).
  */
ITStatus CAN_GetITState(MDR_CAN_TypeDef* CANx, CAN_IT_Def CAN_IT)
{
    ITStatus bitstatus;

    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));
    assert_param(IS_CAN_ITConfig(CAN_IT));

    if ((CANx->INT_EN & CAN_IT) == 0)
    {
        bitstatus = RESET;
    }
    else
    {
        bitstatus = SET;
    }

