ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_can.c
    if (CANx == MDR_CAN1)
    {
        tmpreg |= RST_CLK_CAN_CLOCK_CAN1_CLK_EN;
        tmpreg &= ~RST_CLK_CAN_CLOCK_CAN1_BRG_Msk;
        tmpreg |= CAN_BRG;
    }
    else if (CANx == MDR_CAN2)
    {
        tmpreg |= RST_CLK_CAN_CLOCK_CAN2_CLK_EN;
        tmpreg &= ~RST_CLK_CAN_CLOCK_CAN2_BRG_Msk;
        tmpreg |= (CAN_BRG << 8);
    }

    MDR_RST_CLK->CAN_CLOCK = tmpreg;
}

/**
  * @brief  Service function for some SFRs reading supporting
  *         MDR32FxQI Series Errata Notice, Error 0002 workaround.
  * @note   If WORKAROUND_MDR32F9QX_ERROR_0002 is defined the function performs
  *         corrective actions (IMPORTANT: after SFR reading it enables IRQs in this mode),
  *         otherwise, just reads SFR.
  * @param  SFR: specifies SFR address
  * @retval SFR value
  */
static __INLINE uint32_t CAN_ReadBufferSFR(__IO uint32_t* SFR)
{
#ifdef WORKAROUND_MDR32F9QX_ERROR_0002
    /*
     * MDR32FxQI Series Errata Notice, Error 0002:
     * The registers CAN_BUFxx_ID, CAN_BUFxx_DLC, CAN_BUFxx_DATAL,
     * CAN_BUFxx_DATAH, CAN_BUFxx_MASK or CAN_BUFxx_FILTER value
     * may be incorrectly read as 0 if CAN controller accessed any
     * of that registers at the moment of reading.
     * In such case, another read should be performed in a time less
     * than minimum CAN package.
     */
    uint32_t tmpreg;
    
    __disable_irq();
    tmpreg = *SFR;
    if (tmpreg == 0)
    {
        tmpreg = *SFR;
    }
    __enable_irq();
    return tmpreg;
#else
    return *SFR;
#endif  /* WORKAROUND_MDR32F9QX_ERROR_0002 */
}

/** @} */ /* End of group CAN_Private_Functions */

/** @} */ /* End of group CAN */

#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32F1QI) */

/** @} */ /* End of group __MDR32FxQI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2022 Milandr ****************************
*
* END OF FILE MDR32FxQI_can.c */


